// Лр 10.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <string>
#include <vector>

using namespace std;

// Структура для зберігання інформації про квартиру
struct Apartment {
    string ownerLastName;
    int apartmentNumber;
    int numberOfResidents;
};

int main() {
    vector<Apartment> apartments; // Вектор для зберігання інформації про квартири

    // Введення даних про квартири
    int n;
    cout << "Введіть кількість квартир: ";
    cin >> n;
    for (int i = 0; i < n; ++i) {
        Apartment apt;
        cout << "Квартира #" << i + 1 << ":\n";
        cout << "Прізвище власника: ";
        cin >> apt.ownerLastName;
        cout << "Номер квартири: ";
        cin >> apt.apartmentNumber;
        cout << "Кількість мешканців: ";
        cin >> apt.numberOfResidents;
        apartments.push_back(apt);
    }

    // Виведення повного списку власників квартир
    cout << "\nПовний список власників квартир:\n";
    for (const auto& apt : apartments) {
        cout << apt.ownerLastName << ", квартира #" << apt.apartmentNumber << ", "
            << "кількість мешканців: " << apt.numberOfResidents << endl;
    }

    // Виведення номерів квартир, кількість мешканців яких перевищує 4
    cout << "\nНомери квартир, кількість мешканців яких перевищує 4:\n";
    for (const auto& apt : apartments) {
        if (apt.numberOfResidents > 4) {
            cout << "Квартира #" << apt.apartmentNumber << ", "
                << "кількість мешканців: " << apt.numberOfResidents << endl;
        }
    }

    return 0;
}


// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
